shariltumin/esp32_nat_router_micropython/boards/ESP32_AP_NAT/mpconfigboard.h

#define MICROPY_HW_BOARD_NAME "ESP32 AP-NAT (KAKI5)"
#define MICROPY_HW_MCU_NAME "ESP32"

#define MICROPY_PY_NETWORK_LAN    (0)  // disable LAN support
#define MICROPY_PY_TINYUSB	  (0)  // disable USB support
#define MICROPY_HW_ENABLE_USBDEV  (0)
#define MICROPY_PY_ESPNOW         (0)
